Revit 2027 API
BuiltInFailures.StairRampFailures.CannotCreateLandingStringer Property
 Can't create stringer at landing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateLandingStringer { get; }
Public Shared ReadOnly Property CannotCreateLandingStringer As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateLandingStringer {
	FailureDefinitionId^ get ();
}
static member CannotCreateLandingStringer : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace